Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.WallPlacementPostProcessingService
Autodesk Internal: The service for post processing something after placing a wall

Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.RebarSpliceService
Autodesk Internal: The service for spliping a rebar.

Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.MacroManagerUIService
The UI service which permits registration of an external server for new Macro Manager UI.

Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.AnalyticalCurrentCalculationService
AnalyticalCurrentCalculationService GUID value:{96BBB101-FDDB-4991-BB41-FBC1BE1552BB}
The calculation service for Electrical Analytical Distribution System